Autodesk.Revit.DB.BackgroundProcessTask.IBackgroundProcessTaskCallbackDispatcher.GetOutputSchemaId
Since:
2027

Autodesk.Revit.DB.BackgroundProcessTask.IBackgroundProcessTaskCallbackDispatcher.GetInputSchemaId
Since:
2027

Autodesk.Revit.DB.BackgroundProcessTask.IBackgroundProcessTaskCallbackDispatcher.ProcessOutput(System.Guid,Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ExtensibleStorage.Entity,Autodesk.Revit.DB.BackgroundProcessTask.BackgroundProcessTaskStatus)
id:
The task ID, returned by the service when calling runTask
document:
The document used for the snapshot
outputData:
Task output generated by the executor
status:
The state in which the executor ended the task
Returns:
State to return to the framework, if "None", then the callback handled everything
and framework does nothing.
Since:
2027

Autodesk.Revit.DB.BackgroundProcessTask.IBackgroundProcessTaskCallbackDispatcher
IBackgroundProcessTaskCallbackDispatcher takes the output from
the executor (run on background worker), and executes the callback on the
main process
Since:
2027